---
layout: post
author: utoppia
title: Ağ Güvenliği Basit Kodları
tags: cisco net-security
---


### SYSLOG’A LOG BASMA
	
```shell
Router(config)# logging on 
Router(config)# login on-success log 
Router(config)# login on-failure log 
Router(config)# logging host server-ip
```
### Network Time Protocol 

- **Config the server**, you can also set the authentication of this server;
- **Config the IP address of the devices**;
- **Config the time manually**
	```shell
	Router# clock set hh:mm:ss <1-31> Month Year
	```
- **Config the time asynchronous from server**: 
	```shell
	Router(config)# ntp server server-ip
	Router(config)# ntp authenticate 
	Router(config)# ntp authentication-key 1 md5 password
	Router(config)# ntp trusted-key 1
	```
- **Verify the configuration**:
	```shell
	Router# show ntp associations 
	Router# show clock 
	```
- **Set a Router as NTP master**:
	```shell
	Router(config)# ntp master 1
	```
- **Config switch’s ntp server to be the Router**:
	```shell
	Switch(config)# ntp server ntp-master-router-ip
	```

### Introduction to Access Control List 
- **Named ACL Syntax**
	```shell
	Router(config)# is access-list [standard | extend] name_of_ACL
	```
- **Standard ACE Syntax**:
	```shell
	Router(config-std-nacl)# {permit | deny | remark} [source | [source-wildcard] | any ]
	```
- **Extended ACE Syntax**:
	```shell
	Router(config-ext-nacl)# {permit | deny | remark} protocol source-addr [source-wildcard] dest-address [dest-wildcard] [operator port]
	```

